###############################################################
#  Generated by:      Cadence Innovus 19.13-s080_1
#  OS:                Linux x86_64(Host ID cad52)
#  Generated on:      Sat Dec 27 20:12:02 2025
#  Design:            half_adder
#  Command:           saveDesign /data/zhengyj/OTFT_stdlib/OTFT_stdlib_innovus/half_adder/saved/route.enc
###############################################################
current_design half_adder
create_clock [get_ports {CLK}]  -name CLK -period 20000000.000000 -waveform {0.000000 10000000.000000}
set_propagated_clock  [get_ports {CLK}]
set_driving_cell -lib_cell INVD1 -rise -min -pin OUT [get_ports {CLK}]
set_driving_cell -lib_cell INVD1 -fall -min -pin OUT [get_ports {CLK}]
set_driving_cell -lib_cell INVD1 -rise -max -pin OUT [get_ports {CLK}]
set_driving_cell -lib_cell INVD1 -fall -max -pin OUT [get_ports {CLK}]
set_driving_cell -lib_cell INVD1 -rise -min -pin OUT [get_ports {reset}]
set_driving_cell -lib_cell INVD1 -fall -min -pin OUT [get_ports {reset}]
set_driving_cell -lib_cell INVD1 -rise -max -pin OUT [get_ports {reset}]
set_driving_cell -lib_cell INVD1 -fall -max -pin OUT [get_ports {reset}]
set_driving_cell -lib_cell INVD1 -rise -min -pin OUT [get_ports {in1}]
set_driving_cell -lib_cell INVD1 -fall -min -pin OUT [get_ports {in1}]
set_driving_cell -lib_cell INVD1 -rise -max -pin OUT [get_ports {in1}]
set_driving_cell -lib_cell INVD1 -fall -max -pin OUT [get_ports {in1}]
set_driving_cell -lib_cell INVD1 -rise -min -pin OUT [get_ports {in2}]
set_driving_cell -lib_cell INVD1 -fall -min -pin OUT [get_ports {in2}]
set_driving_cell -lib_cell INVD1 -rise -max -pin OUT [get_ports {in2}]
set_driving_cell -lib_cell INVD1 -fall -max -pin OUT [get_ports {in2}]
set_load -pin_load -max  1.658  [get_ports {sum}]
set_load -pin_load -min  1.658  [get_ports {sum}]
set_load -pin_load -max  1.658  [get_ports {cout}]
set_load -pin_load -min  1.658  [get_ports {cout}]
set_input_delay -add_delay 2e+06 -min -clock [get_clocks {CLK}] [get_ports {in1}]
set_input_delay -add_delay 1e+07 -max -clock [get_clocks {CLK}] [get_ports {in1}]
set_input_delay -add_delay 2e+06 -min -clock [get_clocks {CLK}] [get_ports {reset}]
set_input_delay -add_delay 1e+07 -max -clock [get_clocks {CLK}] [get_ports {reset}]
set_input_delay -add_delay 2e+06 -min -clock [get_clocks {CLK}] [get_ports {in2}]
set_input_delay -add_delay 1e+07 -max -clock [get_clocks {CLK}] [get_ports {in2}]
set_output_delay -add_delay 2e+06 -min -clock [get_clocks {CLK}] [get_ports {cout}]
set_output_delay -add_delay 1e+07 -max -clock [get_clocks {CLK}] [get_ports {cout}]
set_output_delay -add_delay 2e+06 -min -clock [get_clocks {CLK}] [get_ports {sum}]
set_output_delay -add_delay 1e+07 -max -clock [get_clocks {CLK}] [get_ports {sum}]
